In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
ktm = pd.read_csv(r'../data/Kathmandu.csv')
ktm.head()

      station particulate_matter               datetime value
0  Bhaisipati                 PM1  2019-06-20T08:58:00Z   3.7
1  Bhaisipati                 PM1  2019-06-20T09:08:00Z   3.6
2  Bhaisipati                 PM1  2019-06-20T09:18:00Z   3.5
3  Bhaisipati                 PM1  2019-06-20T09:38:00Z   3.8
4  Bhaisipati                 PM1  2019-06-20T09:48:00Z   4.1

In [3]:
ktm.shape

(89886, 4)

In [4]:
ktm.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 89886 entries, 0 to 89885
Data columns (total 4 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   station              89886 non-null  object
 1   particulate_matter   89886 non-null  object
 2   datetime             89886 non-null  object
 3   value                89886 non-null  object
dtypes: object(4)
memory usage: 2.7+ MB

In [5]:
ktm['particulate_matter '].value_counts()

particulate_matter
TSP      22628
PM10     22609
PM2.5    22579
PM1      22070
Name: count, dtype: int64

In [6]:
ktm['datetime'] = pd.to_datetime(ktm['datetime'], utc=True, errors='coerce')

In [7]:
ktm.head()

      station particulate_matter                   datetime value
0  Bhaisipati                 PM1 2019-06-20 08:58:00+00:00   3.7
1  Bhaisipati                 PM1 2019-06-20 09:08:00+00:00   3.6
2  Bhaisipati                 PM1 2019-06-20 09:18:00+00:00   3.5
3  Bhaisipati                 PM1 2019-06-20 09:38:00+00:00   3.8
4  Bhaisipati                 PM1 2019-06-20 09:48:00+00:00   4.1

In [8]:
ktm.isnull().sum()

station                0
particulate_matter     0
datetime               0
value                  0
dtype: int64

In [9]:
ktm = ktm.drop_duplicates()

In [10]:
nepal = pd.read_csv(r'../data/NepalLatestAQI.csv')
nepal.head()

,date,station,latitude,longitude,aqi,pm2_5,pm10,no2,so2,o3,temperature_C,relative_humidity_%,notes
0,2024-01-01,Kathmandu,27.7172,85.3240,162,75.9,161.5,18.5,8.0,16.2,20.9,65.2,NaN
1,2024-01-01,Lalitpur,27.6648,85.3188,157,66.9,105.9,18.2,4.2,34.1,28.8,76.2,NaN
2,2024-01-01,Bhaktapur,27.6714,85.4270,166,84.8,182.9,16.4,7.1,26.7,20.3,60.9,NaN
3,2024-01-01,Pokhara,28.2096,83.9856,79,25.5,47.8,2.0,1.0,31.7,23.0,47.9,NaN
4,2024-01-01,Biratnagar,26.4525,87.2718,146,53.8,86.3,17.2,1.9,34.5,23.9,54.1,NaN

In [11]:
nepal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9840 entries, 0 to 9839
Data columns (total 13 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   date                 9840 non-null   object
 1   station              9840 non-null   object
 2   latitude             9840 non-null   float64
 3   longitude            9840 non-null   float64
 4   aqi                  9840 non-null   int64
 5   pm2_5                9840 non-null   float64
 6   pm10                 9840 non-null   float64
 7   no2                  9840 non-null   float64
 8   so2                  9840 non-null   float64
 9   o3                   9840 non-null   float64
 10  temperature_C        9840 non-null   float64
 11  relative_humidity_%  9840 non-null   float64
 12  notes                79 non-null     object
dtypes: float64(9), int64(1), object(3)
memory usage: 999.5+ KB

In [12]:
nepal.describe()

,latitude,longitude,aqi,pm2_5,pm10,no2,so2,o3,temperature_C,relative_humidity_%
count,9840.000000,9840.000000,9840.000000,9840.000000,9840.000000,9840.000000,9840.000000,9840.000000,9840.000000,9840.000000
mean,27.597567,84.708673,98.507724,34.610203,69.379736,14.154380,3.745447,40.985793,21.263211,55.461240
std,0.743159,2.024066,46.093600,18.904674,40.546733,7.935624,1.884605,14.794235,7.787653,14.842697
min,26.452500,80.591200,4.000000,1.000000,1.000000,2.000000,1.000000,3.800000,1.100000,10.000000
25%,26.890100,83.450000,70.000000,21.200000,40.800000,8.000000,2.300000,29.875000,14.500000,45.000000
50%,27.671400,85.030600,93.000000,32.000000,63.100000,13.400000,3.600000,38.600000,21.900000,54.500000
75%,28.058200,85.924600,124.250000,44.800000,90.300000,19.700000,5.000000,50.600000,27.800000,65.300000
max,29.274100,87.920400,500.000000,185.500000,450.500000,43.400000,11.000000,98.900000,40.000000,100.000000